In [1]:
import numpy as np
import pandas as pd

In [3]:
data = {
'Company': ['GOOG', 'GOOG', 'MSFT','MSFT','FB','FB'],
'Person' : ['Sam','Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
'Sales'  : [200,120,340,124,243,350]
}

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [10]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [16]:
group_by_company = df.groupby('Company')                      
# group by the entire data based on coloum - company

In [19]:
group_by_company.mean('Sales')

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [20]:
group_by_company.sum('Sales')
# on the grouped data we can perform diff operation like sum, mean , by using a perticular coloum , here sales coloum is used

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [24]:
group_by_company.sum('Sales').loc['FB'] 
# this only shows the company - 'FB' sum of 'Sales'

Sales    593
Name: FB, dtype: int64

In [25]:
group_by_company.max('Sales')

         Sales
Company
FB         350
GOOG       200
MSFT       340

In [27]:
group_by_company.describe()                                  
#this will give us a bunch of information
#we can also use .transpose() in the end to get company wise information

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000